      ******************************************************************
      * Author: Kiviaal
      * Date: 10/01/2022
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. YOUR-PROGRAM-NAME.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "Hello world"
            DISPLAY "********* FIM DE PROCESSAMENTO ***********"
            STOP RUN.
       END PROGRAM YOUR-PROGRAM-NAME.
